name: "ocr_en_set001_train_test"
layers {
  name: "data"
  type:DATA
  top: "data"
  top: "label"
  data_param{
	  source: "/home/wuxiang/project/text_recognition/data/words/lmdb/set001_train_lmdb"
	  backend: LMDB
	  batch_size: 128
	}
  transform_param {
    scale: 0.00390625
  }
  include: { phase: TRAIN }
}

layers {
  name: "data"
  type: DATA
  top: "data"
  top: "label"
  data_param{
	  source: "/home/wuxiang/project/text_recognition/data/words/lmdb/set001_val_lmdb"
	  backend: LMDB
	  batch_size: 30
	}
  transform_param {
    scale: 0.00390625
  }
  include: { phase: TEST }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 16
    kernel_h: 5
	kernel_w: 9
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}

layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 32
    kernel_h: 5
	kernel_w: 9
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}

layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  convolution_param {
    num_output: 64
    kernel_h: 3
	kernel_w: 6
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}

layers {
  name: "pool3"
  type: POOLING
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "pool3"
  top: "conv4"
  convolution_param {
    num_output: 96
    kernel_h: 2
	kernel_w: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "relu4"
  type: RELU
  bottom: "conv4"
  top: "conv4"
}
layers{
  name: "fc1"
  type: INNER_PRODUCT

  inner_product_param{
	num_output: 64
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}	
  }
  bottom: "conv4"
  top: "fc1"
}

layers {
  name: "relu5"
  type: RELU
  bottom: "fc1"
  top: "fc1"
}

layers {
	name: "dropout1"
	type: DROPOUT
	bottom: "fc1"
	top: "dropout1"	
	dropout_param {
		dropout_ratio: 0.5
  }
}

layers{
  name: "fc2"
  type: INNER_PRODUCT

  inner_product_param{
	num_output: 19
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}	
  }
  bottom: "dropout1"
  top: "fc2"  
}

layers {
  name: "softmax"
  type: SOFTMAX
  bottom: "fc2"
  top: "prob"
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "prob"
  bottom: "label"
  top: "accuracy"
}

layers{
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "fc2"
  bottom: "label"
  loss_weight: 1 
}


